espressif/esp-idf/components/soc/esp32s31/register/soc/tee_reg.h
/** TEE_M29_MODE_CTRL_REG register
 *  TEE mode control register
 */
#define TEE_M29_MODE_CTRL_REG (DR_REG_TEE_BASE + 0x74)
/** TEE_M29_MODE : R/W; bitpos: [1:0]; default: 3;
 *  Configures M29 security level mode.
 *  0: tee_mode
 *  1: ree_mode0
 *  2: ree_mode1
 *  3: ree_mode2
 */
#define TEE_M29_MODE    0x00000003U
#define TEE_M29_MODE_M  (TEE_M29_MODE_V << TEE_M29_MODE_S)
#define TEE_M29_MODE_V  0x00000003U
#define TEE_M29_MODE_S  0
/** TEE_M29_LOCK : R/W; bitpos: [2]; default: 0;
 *  Set 1 to lock m20 tee configuration
 */
#define TEE_M29_LOCK    (BIT(2))
#define TEE_M29_LOCK_M  (TEE_M29_LOCK_V << TEE_M29_LOCK_S)
#define TEE_M29_LOCK_V  0x00000001U
#define TEE_M29_LOCK_S  2

/** TEE_M30_MODE_CTRL_REG register
 *  TEE mode control register
 */
#define TEE_M30_MODE_CTRL_REG (DR_REG_TEE_BASE + 0x78)
/** TEE_M30_MODE : R/W; bitpos: [1:0]; default: 3;
 *  Configures M30 security level mode.
 *  0: tee_mode
 *  1: ree_mode0
 *  2: ree_mode1
 *  3: ree_mode2
 */
#define TEE_M30_MODE    0x00000003U
#define TEE_M30_MODE_M  (TEE_M30_MODE_V << TEE_M30_MODE_S)
#define TEE_M30_MODE_V  0x00000003U
#define TEE_M30_MODE_S  0
/** TEE_M30_LOCK : R/W; bitpos: [2]; default: 0;
 *  Set 1 to lock m20 tee configuration
 */
#define TEE_M30_LOCK    (BIT(2))
#define TEE_M30_LOCK_M  (TEE_M30_LOCK_V << TEE_M30_LOCK_S)
#define TEE_M30_LOCK_V  0x00000001U
#define TEE_M30_LOCK_S  2

/** TEE_M31_MODE_CTRL_REG register
 *  TEE mode control register
 */
#define TEE_M31_MODE_CTRL_REG (DR_REG_TEE_BASE + 0x7c)
/** TEE_M31_MODE : R/W; bitpos: [1:0]; default: 3;
 *  Configures M31 security level mode.
 *  0: tee_mode
 *  1: ree_mode0
 *  2: ree_mode1
 *  3: ree_mode2
 */
#define TEE_M31_MODE    0x00000003U
#define TEE_M31_MODE_M  (TEE_M31_MODE_V << TEE_M31_MODE_S)
#define TEE_M31_MODE_V  0x00000003U
#define TEE_M31_MODE_S  0
/** TEE_M31_LOCK : R/W; bitpos: [2]; default: 0;
 *  Set 1 to lock m20 tee configuration
 */
#define TEE_M31_LOCK    (BIT(2))
#define TEE_M31_LOCK_M  (TEE_M31_LOCK_V << TEE_M31_LOCK_S)
#define TEE_M31_LOCK_V  0x00000001U
#define TEE_M31_LOCK_S  2

/** TEE_M32_MODE_CTRL_REG register
 *  TEE mode control register
 */
#define TEE_M32_MODE_CTRL_REG (DR_REG_TEE_BASE + 0x80)
/** TEE_M32_MODE : R/W; bitpos: [1:0]; default: 3;
 *  Configures M32 security level mode.
 *  0: tee_mode
 *  1: ree_mode0
 *  2: ree_mode1
 *  3: ree_mode2
 */
#define TEE_M32_MODE    0x00000003U
#define TEE_M32_MODE_M  (TEE_M32_MODE_V << TEE_M32_MODE_S)
#define TEE_M32_MODE_V  0x00000003U
#define TEE_M32_MODE_S  0
/** TEE_M32_LOCK : R/W; bitpos: [2]; default: 0;
 *  Set 1 to lock m20 tee configuration
 */
#define TEE_M32_LOCK    (BIT(2))
#define TEE_M32_LOCK_M  (TEE_M32_LOCK_V << TEE_M32_LOCK_S)
#define TEE_M32_LOCK_V  0x00000001U
#define TEE_M32_LOCK_S  2

/** TEE_M33_MODE_CTRL_REG register
 *  TEE mode control register
 */
#define TEE_M33_MODE_CTRL_REG (DR_REG_TEE_BASE + 0x84)
/** TEE_M33_MODE : R/W; bitpos: [1:0]; default: 3;
 *  Configures M33 security level mode.
 *  0: tee_mode
 *  1: ree_mode0
 *  2: ree_mode1
 *  3: ree_mode2
 */
#define TEE_M33_MODE    0x00000003U
#define TEE_M33_MODE_M  (TEE_M33_MODE_V << TEE_M33_MODE_S)
#define TEE_M33_MODE_V  0x00000003U
#define TEE_M33_MODE_S  0
/** TEE_M33_LOCK : R/W; bitpos: [2]; default: 0;
 *  Set 1 to lock m20 tee configuration
 */
#define TEE_M33_LOCK    (BIT(2))
#define TEE_M33_LOCK_M  (TEE_M33_LOCK_V << TEE_M33_LOCK_S)
#define TEE_M33_LOCK_V  0x00000001U
#define TEE_M33_LOCK_S  2

/** TEE_M34_MODE_CTRL_REG register
 *  TEE mode control register
 */
#define TEE_M34_MODE_CTRL_REG (DR_REG_TEE_BASE + 0x88)
/** TEE_M34_MODE : R/W; bitpos: [1:0]; default: 3;
 *  Configures M34 security level mode.
 *  0: tee_mode
 *  1: ree_mode0
 *  2: ree_mode1
 *  3: ree_mode2
 */
#define TEE_M34_MODE    0x00000003U
#define TEE_M34_MODE_M  (TEE_M34_MODE_V << TEE_M34_MODE_S)
#define TEE_M34_MODE_V  0x00000003U
#define TEE_M34_MODE_S  0
/** TEE_M34_LOCK : R/W; bitpos: [2]; default: 0;
 *  Set 1 to lock m20 tee configuration
 */
#define TEE_M34_LOCK    (BIT(2))
#define TEE_M34_LOCK_M  (TEE_M34_LOCK_V << TEE_M34_LOCK_S)
#define TEE_M34_LOCK_V  0x00000001U
#define TEE_M34_LOCK_S  2

/** TEE_M35_MODE_CTRL_REG register
 *  TEE mode control register
 */
#define TEE_M35_MODE_CTRL_REG (DR_REG_TEE_BASE + 0x8c)
/** TEE_M35_MODE : R/W; bitpos: [1:0]; default: 3;
 *  Configures M35 security level mode.
 *  0: tee_mode
 *  1: ree_mode0
 *  2: ree_mode1
 *  3: ree_mode2
 */
#define TEE_M35_MODE    0x00000003U
#define TEE_M35_MODE_M  (TEE_M35_MODE_V << TEE_M35_MODE_S)
#define TEE_M35_MODE_V  0x00000003U
#define TEE_M35_MODE_S  0
/** TEE_M35_LOCK : R/W; bitpos: [2]; default: 0;
 *  Set 1 to lock m20 tee configuration
 */
#define TEE_M35_LOCK    (BIT(2))
#define TEE_M35_LOCK_M  (TEE_M35_LOCK_V << TEE_M35_LOCK_S)
#define TEE_M35_LOCK_V  0x00000001U
#define TEE_M35_LOCK_S  2

/** TEE_M36_MODE_CTRL_REG register
 *  TEE mode control register
 */
#define TEE_M36_MODE_CTRL_REG (DR_REG_TEE_BASE + 0x90)
/** TEE_M36_MODE : R/W; bitpos: [1:0]; default: 3;
 *  Configures M36 security level mode.
 *  0: tee_mode
 *  1: ree_mode0
 *  2: ree_mode1
 *  3: ree_mode2
 */
#define TEE_M36_MODE    0x00000003U
#define TEE_M36_MODE_M  (TEE_M36_MODE_V << TEE_M36_MODE_S)
#define TEE_M36_MODE_V  0x00000003U
#define TEE_M36_MODE_S  0
/** TEE_M36_LOCK : R/W; bitpos: [2]; default: 0;
 *  Set 1 to lock m20 tee configuration
 */
#define TEE_M36_LOCK    (BIT(2))
#define TEE_M36_LOCK_M  (TEE_M36_LOCK_V << TEE_M36_LOCK_S)
#define TEE_M36_LOCK_V  0x00000001U
#define TEE_M36_LOCK_S  2

/** TEE_M37_MODE_CTRL_REG register
 *  TEE mode control register
 */
#define TEE_M37_MODE_CTRL_REG (DR_REG_TEE_BASE + 0x94)
/** TEE_M37_MODE : R/W; bitpos: [1:0]; default: 3;
 *  Configures M37 security level mode.
 *  0: tee_mode
 *  1: ree_mode0
 *  2: ree_mode1
 *  3: ree_mode2
 */
#define TEE_M37_MODE    0x00000003U
#define TEE_M37_MODE_M  (TEE_M37_MODE_V << TEE_M37_MODE_S)
#define TEE_M37_MODE_V  0x00000003U
#define TEE_M37_MODE_S  0
/** TEE_M37_LOCK : R/W; bitpos: [2]; default: 0;
 *  Set 1 to lock m20 tee configuration
 */
#define TEE_M37_LOCK    (BIT(2))
#define TEE_M37_LOCK_M  (TEE_M37_LOCK_V << TEE_M37_LOCK_S)
#define TEE_M37_LOCK_V  0x00000001U
#define TEE_M37_LOCK_S  2

/** TEE_M38_MODE_CTRL_REG register
 *  TEE mode control register
 */
#define TEE_M38_MODE_CTRL_REG (DR_REG_TEE_BASE + 0x98)
/** TEE_M38_MODE : R/W; bitpos: [1:0]; default: 3;
 *  Configures M38 security level mode.
 *  0: tee_mode
 *  1: ree_mode0
 *  2: ree_mode1
 *  3: ree_mode2
 */
#define TEE_M38_MODE    0x00000003U
#define TEE_M38_MODE_M  (TEE_M38_MODE_V << TEE_M38_MODE_S)
#define TEE_M38_MODE_V  0x00000003U
#define TEE_M38_MODE_S  0
/** TEE_M38_LOCK : R/W; bitpos: [2]; default: 0;
 *  Set 1 to lock m20 tee configuration
 */
#define TEE_M38_LOCK    (BIT(2))
#define TEE_M38_LOCK_M  (TEE_M38_LOCK_V << TEE_M38_LOCK_S)
#define TEE_M38_LOCK_V  0x00000001U
#define TEE_M38_LOCK_S  2

/** TEE_M39_MODE_CTRL_REG register
 *  TEE mode control register
 */
#define TEE_M39_MODE_CTRL_REG (DR_REG_TEE_BASE + 0x9c)
/** TEE_M39_MODE : R/W; bitpos: [1:0]; default: 3;
 *  Configures M39 security level mode.
 *  0: tee_mode
 *  1: ree_mode0
 *  2: ree_mode1
 *  3: ree_mode2
 */
#define TEE_M39_MODE    0x00000003U
#define TEE_M39_MODE_M  (TEE_M39_MODE_V << TEE_M39_MODE_S)
#define TEE_M39_MODE_V  0x00000003U
#define TEE_M39_MODE_S  0
/** TEE_M39_LOCK : R/W; bitpos: [2]; default: 0;
 *  Set 1 to lock m20 tee configuration
 */
#define TEE_M39_LOCK    (BIT(2))
#define TEE_M39_LOCK_M  (TEE_M39_LOCK_V << TEE_M39_LOCK_S)
#define TEE_M39_LOCK_V  0x00000001U
#define TEE_M39_LOCK_S  2

/** TEE_M40_MODE_CTRL_REG register
 *  TEE mode control register
 */
#define TEE_M40_MODE_CTRL_REG (DR_REG_TEE_BASE + 0xa0)
/** TEE_M40_MODE : R/W; bitpos: [1:0]; default: 3;
 *  Configures M40 security level mode.
 *  0: tee_mode
 *  1: ree_mode0
 *  2: ree_mode1
 *  3: ree_mode2
 */
#define TEE_M40_MODE    0x00000003U
#define TEE_M40_MODE_M  (TEE_M40_MODE_V << TEE_M40_MODE_S)
#define TEE_M40_MODE_V  0x00000003U
#define TEE_M40_MODE_S  0
/** TEE_M40_LOCK : R/W; bitpos: [2]; default: 0;
 *  Set 1 to lock m20 tee configuration
 */
#define TEE_M40_LOCK    (BIT(2))
#define TEE_M40_LOCK_M  (TEE_M40_LOCK_V << TEE_M40_LOCK_S)
#define TEE_M40_LOCK_V  0x00000001U
#define TEE_M40_LOCK_S  2

