espressif/esp-idf/components/soc/esp32s31/register/soc/tee_reg.h
/** TEE_M41_MODE_CTRL_REG register
 *  TEE mode control register
 */
#define TEE_M41_MODE_CTRL_REG (DR_REG_TEE_BASE + 0xa4)
/** TEE_M41_MODE : R/W; bitpos: [1:0]; default: 3;
 *  Configures M41 security level mode.
 *  0: tee_mode
 *  1: ree_mode0
 *  2: ree_mode1
 *  3: ree_mode2
 */
#define TEE_M41_MODE    0x00000003U
#define TEE_M41_MODE_M  (TEE_M41_MODE_V << TEE_M41_MODE_S)
#define TEE_M41_MODE_V  0x00000003U
#define TEE_M41_MODE_S  0
/** TEE_M41_LOCK : R/W; bitpos: [2]; default: 0;
 *  Set 1 to lock m20 tee configuration
 */
#define TEE_M41_LOCK    (BIT(2))
#define TEE_M41_LOCK_M  (TEE_M41_LOCK_V << TEE_M41_LOCK_S)
#define TEE_M41_LOCK_V  0x00000001U
#define TEE_M41_LOCK_S  2

/** TEE_M42_MODE_CTRL_REG register
 *  TEE mode control register
 */
#define TEE_M42_MODE_CTRL_REG (DR_REG_TEE_BASE + 0xa8)
/** TEE_M42_MODE : R/W; bitpos: [1:0]; default: 3;
 *  Configures M42 security level mode.
 *  0: tee_mode
 *  1: ree_mode0
 *  2: ree_mode1
 *  3: ree_mode2
 */
#define TEE_M42_MODE    0x00000003U
#define TEE_M42_MODE_M  (TEE_M42_MODE_V << TEE_M42_MODE_S)
#define TEE_M42_MODE_V  0x00000003U
#define TEE_M42_MODE_S  0
/** TEE_M42_LOCK : R/W; bitpos: [2]; default: 0;
 *  Set 1 to lock m20 tee configuration
 */
#define TEE_M42_LOCK    (BIT(2))
#define TEE_M42_LOCK_M  (TEE_M42_LOCK_V << TEE_M42_LOCK_S)
#define TEE_M42_LOCK_V  0x00000001U
#define TEE_M42_LOCK_S  2

/** TEE_M43_MODE_CTRL_REG register
 *  TEE mode control register
 */
#define TEE_M43_MODE_CTRL_REG (DR_REG_TEE_BASE + 0xac)
/** TEE_M43_MODE : R/W; bitpos: [1:0]; default: 3;
 *  Configures M43 security level mode.
 *  0: tee_mode
 *  1: ree_mode0
 *  2: ree_mode1
 *  3: ree_mode2
 */
#define TEE_M43_MODE    0x00000003U
#define TEE_M43_MODE_M  (TEE_M43_MODE_V << TEE_M43_MODE_S)
#define TEE_M43_MODE_V  0x00000003U
#define TEE_M43_MODE_S  0
/** TEE_M43_LOCK : R/W; bitpos: [2]; default: 0;
 *  Set 1 to lock m20 tee configuration
 */
#define TEE_M43_LOCK    (BIT(2))
#define TEE_M43_LOCK_M  (TEE_M43_LOCK_V << TEE_M43_LOCK_S)
#define TEE_M43_LOCK_V  0x00000001U
#define TEE_M43_LOCK_S  2

/** TEE_M44_MODE_CTRL_REG register
 *  TEE mode control register
 */
#define TEE_M44_MODE_CTRL_REG (DR_REG_TEE_BASE + 0xb0)
/** TEE_M44_MODE : R/W; bitpos: [1:0]; default: 3;
 *  Configures M44 security level mode.
 *  0: tee_mode
 *  1: ree_mode0
 *  2: ree_mode1
 *  3: ree_mode2
 */
#define TEE_M44_MODE    0x00000003U
#define TEE_M44_MODE_M  (TEE_M44_MODE_V << TEE_M44_MODE_S)
#define TEE_M44_MODE_V  0x00000003U
#define TEE_M44_MODE_S  0
/** TEE_M44_LOCK : R/W; bitpos: [2]; default: 0;
 *  Set 1 to lock m20 tee configuration
 */
#define TEE_M44_LOCK    (BIT(2))
#define TEE_M44_LOCK_M  (TEE_M44_LOCK_V << TEE_M44_LOCK_S)
#define TEE_M44_LOCK_V  0x00000001U
#define TEE_M44_LOCK_S  2

/** TEE_M45_MODE_CTRL_REG register
 *  TEE mode control register
 */
#define TEE_M45_MODE_CTRL_REG (DR_REG_TEE_BASE + 0xb4)
/** TEE_M45_MODE : R/W; bitpos: [1:0]; default: 3;
 *  Configures M45 security level mode.
 *  0: tee_mode
 *  1: ree_mode0
 *  2: ree_mode1
 *  3: ree_mode2
 */
#define TEE_M45_MODE    0x00000003U
#define TEE_M45_MODE_M  (TEE_M45_MODE_V << TEE_M45_MODE_S)
#define TEE_M45_MODE_V  0x00000003U
#define TEE_M45_MODE_S  0
/** TEE_M45_LOCK : R/W; bitpos: [2]; default: 0;
 *  Set 1 to lock m20 tee configuration
 */
#define TEE_M45_LOCK    (BIT(2))
#define TEE_M45_LOCK_M  (TEE_M45_LOCK_V << TEE_M45_LOCK_S)
#define TEE_M45_LOCK_V  0x00000001U
#define TEE_M45_LOCK_S  2

/** TEE_M46_MODE_CTRL_REG register
 *  TEE mode control register
 */
#define TEE_M46_MODE_CTRL_REG (DR_REG_TEE_BASE + 0xb8)
/** TEE_M46_MODE : R/W; bitpos: [1:0]; default: 3;
 *  Configures M46 security level mode.
 *  0: tee_mode
 *  1: ree_mode0
 *  2: ree_mode1
 *  3: ree_mode2
 */
#define TEE_M46_MODE    0x00000003U
#define TEE_M46_MODE_M  (TEE_M46_MODE_V << TEE_M46_MODE_S)
#define TEE_M46_MODE_V  0x00000003U
#define TEE_M46_MODE_S  0
/** TEE_M46_LOCK : R/W; bitpos: [2]; default: 0;
 *  Set 1 to lock m20 tee configuration
 */
#define TEE_M46_LOCK    (BIT(2))
#define TEE_M46_LOCK_M  (TEE_M46_LOCK_V << TEE_M46_LOCK_S)
#define TEE_M46_LOCK_V  0x00000001U
#define TEE_M46_LOCK_S  2

/** TEE_M47_MODE_CTRL_REG register
 *  TEE mode control register
 */
#define TEE_M47_MODE_CTRL_REG (DR_REG_TEE_BASE + 0xbc)
/** TEE_M47_MODE : R/W; bitpos: [1:0]; default: 3;
 *  Configures M47 security level mode.
 *  0: tee_mode
 *  1: ree_mode0
 *  2: ree_mode1
 *  3: ree_mode2
 */
#define TEE_M47_MODE    0x00000003U
#define TEE_M47_MODE_M  (TEE_M47_MODE_V << TEE_M47_MODE_S)
#define TEE_M47_MODE_V  0x00000003U
#define TEE_M47_MODE_S  0
/** TEE_M47_LOCK : R/W; bitpos: [2]; default: 0;
 *  Set 1 to lock m20 tee configuration
 */
#define TEE_M47_LOCK    (BIT(2))
#define TEE_M47_LOCK_M  (TEE_M47_LOCK_V << TEE_M47_LOCK_S)
#define TEE_M47_LOCK_V  0x00000001U
#define TEE_M47_LOCK_S  2

/** TEE_M48_MODE_CTRL_REG register
 *  TEE mode control register
 */
#define TEE_M48_MODE_CTRL_REG (DR_REG_TEE_BASE + 0xc0)
/** TEE_M48_MODE : R/W; bitpos: [1:0]; default: 3;
 *  Configures M48 security level mode.
 *  0: tee_mode
 *  1: ree_mode0
 *  2: ree_mode1
 *  3: ree_mode2
 */
#define TEE_M48_MODE    0x00000003U
#define TEE_M48_MODE_M  (TEE_M48_MODE_V << TEE_M48_MODE_S)
#define TEE_M48_MODE_V  0x00000003U
#define TEE_M48_MODE_S  0
/** TEE_M48_LOCK : R/W; bitpos: [2]; default: 0;
 *  Set 1 to lock m20 tee configuration
 */
#define TEE_M48_LOCK    (BIT(2))
#define TEE_M48_LOCK_M  (TEE_M48_LOCK_V << TEE_M48_LOCK_S)
#define TEE_M48_LOCK_V  0x00000001U
#define TEE_M48_LOCK_S  2

/** TEE_M49_MODE_CTRL_REG register
 *  TEE mode control register
 */
#define TEE_M49_MODE_CTRL_REG (DR_REG_TEE_BASE + 0xc4)
/** TEE_M49_MODE : R/W; bitpos: [1:0]; default: 3;
 *  Configures M49 security level mode.
 *  0: tee_mode
 *  1: ree_mode0
 *  2: ree_mode1
 *  3: ree_mode2
 */
#define TEE_M49_MODE    0x00000003U
#define TEE_M49_MODE_M  (TEE_M49_MODE_V << TEE_M49_MODE_S)
#define TEE_M49_MODE_V  0x00000003U
#define TEE_M49_MODE_S  0
/** TEE_M49_LOCK : R/W; bitpos: [2]; default: 0;
 *  Set 1 to lock m20 tee configuration
 */
#define TEE_M49_LOCK    (BIT(2))
#define TEE_M49_LOCK_M  (TEE_M49_LOCK_V << TEE_M49_LOCK_S)
#define TEE_M49_LOCK_V  0x00000001U
#define TEE_M49_LOCK_S  2

/** TEE_M50_MODE_CTRL_REG register
 *  TEE mode control register
 */
#define TEE_M50_MODE_CTRL_REG (DR_REG_TEE_BASE + 0xc8)
/** TEE_M50_MODE : R/W; bitpos: [1:0]; default: 3;
 *  Configures M50 security level mode.
 *  0: tee_mode
 *  1: ree_mode0
 *  2: ree_mode1
 *  3: ree_mode2
 */
#define TEE_M50_MODE    0x00000003U
#define TEE_M50_MODE_M  (TEE_M50_MODE_V << TEE_M50_MODE_S)
#define TEE_M50_MODE_V  0x00000003U
#define TEE_M50_MODE_S  0
/** TEE_M50_LOCK : R/W; bitpos: [2]; default: 0;
 *  Set 1 to lock m20 tee configuration
 */
#define TEE_M50_LOCK    (BIT(2))
#define TEE_M50_LOCK_M  (TEE_M50_LOCK_V << TEE_M50_LOCK_S)
#define TEE_M50_LOCK_V  0x00000001U
#define TEE_M50_LOCK_S  2

/** TEE_M51_MODE_CTRL_REG register
 *  TEE mode control register
 */
#define TEE_M51_MODE_CTRL_REG (DR_REG_TEE_BASE + 0xcc)
/** TEE_M51_MODE : R/W; bitpos: [1:0]; default: 3;
 *  Configures M51 security level mode.
 *  0: tee_mode
 *  1: ree_mode0
 *  2: ree_mode1
 *  3: ree_mode2
 */
#define TEE_M51_MODE    0x00000003U
#define TEE_M51_MODE_M  (TEE_M51_MODE_V << TEE_M51_MODE_S)
#define TEE_M51_MODE_V  0x00000003U
#define TEE_M51_MODE_S  0
/** TEE_M51_LOCK : R/W; bitpos: [2]; default: 0;
 *  Set 1 to lock m20 tee configuration
 */
#define TEE_M51_LOCK    (BIT(2))
#define TEE_M51_LOCK_M  (TEE_M51_LOCK_V << TEE_M51_LOCK_S)
#define TEE_M51_LOCK_V  0x00000001U
#define TEE_M51_LOCK_S  2

/** TEE_M52_MODE_CTRL_REG register
 *  TEE mode control register
 */
#define TEE_M52_MODE_CTRL_REG (DR_REG_TEE_BASE + 0xd0)
/** TEE_M52_MODE : R/W; bitpos: [1:0]; default: 3;
 *  Configures M52 security level mode.
 *  0: tee_mode
 *  1: ree_mode0
 *  2: ree_mode1
 *  3: ree_mode2
 */
#define TEE_M52_MODE    0x00000003U
#define TEE_M52_MODE_M  (TEE_M52_MODE_V << TEE_M52_MODE_S)
#define TEE_M52_MODE_V  0x00000003U
#define TEE_M52_MODE_S  0
/** TEE_M52_LOCK : R/W; bitpos: [2]; default: 0;
 *  Set 1 to lock m20 tee configuration
 */
#define TEE_M52_LOCK    (BIT(2))
#define TEE_M52_LOCK_M  (TEE_M52_LOCK_V << TEE_M52_LOCK_S)
#define TEE_M52_LOCK_V  0x00000001U
#define TEE_M52_LOCK_S  2

/** TEE_M53_MODE_CTRL_REG register
 *  TEE mode control register
 */
#define TEE_M53_MODE_CTRL_REG (DR_REG_TEE_BASE + 0xd4)
/** TEE_M53_MODE : R/W; bitpos: [1:0]; default: 3;
 *  Configures M53 security level mode.
 *  0: tee_mode
 *  1: ree_mode0
 *  2: ree_mode1
 *  3: ree_mode2
 */
#define TEE_M53_MODE    0x00000003U
#define TEE_M53_MODE_M  (TEE_M53_MODE_V << TEE_M53_MODE_S)
#define TEE_M53_MODE_V  0x00000003U
#define TEE_M53_MODE_S  0
/** TEE_M53_LOCK : R/W; bitpos: [2]; default: 0;
 *  Set 1 to lock m20 tee configuration
 */
#define TEE_M53_LOCK    (BIT(2))
#define TEE_M53_LOCK_M  (TEE_M53_LOCK_V << TEE_M53_LOCK_S)
#define TEE_M53_LOCK_V  0x00000001U
#define TEE_M53_LOCK_S  2

/** TEE_M54_MODE_CTRL_REG register
 *  TEE mode control register
 */
#define TEE_M54_MODE_CTRL_REG (DR_REG_TEE_BASE + 0xd8)
/** TEE_M54_MODE : R/W; bitpos: [1:0]; default: 3;
 *  Configures M54 security level mode.
 *  0: tee_mode
 *  1: ree_mode0
 *  2: ree_mode1
 *  3: ree_mode2
 */
#define TEE_M54_MODE    0x00000003U
#define TEE_M54_MODE_M  (TEE_M54_MODE_V << TEE_M54_MODE_S)
#define TEE_M54_MODE_V  0x00000003U
#define TEE_M54_MODE_S  0
/** TEE_M54_LOCK : R/W; bitpos: [2]; default: 0;
 *  Set 1 to lock m20 tee configuration
 */
#define TEE_M54_LOCK    (BIT(2))
#define TEE_M54_LOCK_M  (TEE_M54_LOCK_V << TEE_M54_LOCK_S)
#define TEE_M54_LOCK_V  0x00000001U
#define TEE_M54_LOCK_S  2

/** TEE_M55_MODE_CTRL_REG register
 *  TEE mode control register
 */
#define TEE_M55_MODE_CTRL_REG (DR_REG_TEE_BASE + 0xdc)
/** TEE_M55_MODE : R/W; bitpos: [1:0]; default: 3;
 *  Configures M55 security level mode.
 *  0: tee_mode
 *  1: ree_mode0
 *  2: ree_mode1
 *  3: ree_mode2
 */
#define TEE_M55_MODE    0x00000003U
#define TEE_M55_MODE_M  (TEE_M55_MODE_V << TEE_M55_MODE_S)
#define TEE_M55_MODE_V  0x00000003U
#define TEE_M55_MODE_S  0
/** TEE_M55_LOCK : R/W; bitpos: [2]; default: 0;
 *  Set 1 to lock m20 tee configuration
 */
#define TEE_M55_LOCK    (BIT(2))
#define TEE_M55_LOCK_M  (TEE_M55_LOCK_V << TEE_M55_LOCK_S)
#define TEE_M55_LOCK_V  0x00000001U
#define TEE_M55_LOCK_S  2

/** TEE_M56_MODE_CTRL_REG register
 *  TEE mode control register
 */
#define TEE_M56_MODE_CTRL_REG (DR_REG_TEE_BASE + 0xe0)
/** TEE_M56_MODE : R/W; bitpos: [1:0]; default: 3;
 *  Configures M56 security level mode.
 *  0: tee_mode
 *  1: ree_mode0
 *  2: ree_mode1
 *  3: ree_mode2
 */
#define TEE_M56_MODE    0x00000003U
#define TEE_M56_MODE_M  (TEE_M56_MODE_V << TEE_M56_MODE_S)
#define TEE_M56_MODE_V  0x00000003U
#define TEE_M56_MODE_S  0
/** TEE_M56_LOCK : R/W; bitpos: [2]; default: 0;
 *  Set 1 to lock m20 tee configuration
 */
#define TEE_M56_LOCK    (BIT(2))
#define TEE_M56_LOCK_M  (TEE_M56_LOCK_V << TEE_M56_LOCK_S)
#define TEE_M56_LOCK_V  0x00000001U
#define TEE_M56_LOCK_S  2

/** TEE_M57_MODE_CTRL_REG register
 *  TEE mode control register
 */
#define TEE_M57_MODE_CTRL_REG (DR_REG_TEE_BASE + 0xe4)
/** TEE_M57_MODE : R/W; bitpos: [1:0]; default: 3;
 *  Configures M57 security level mode.
 *  0: tee_mode
 *  1: ree_mode0
 *  2: ree_mode1
 *  3: ree_mode2
 */
#define TEE_M57_MODE    0x00000003U
#define TEE_M57_MODE_M  (TEE_M57_MODE_V << TEE_M57_MODE_S)
#define TEE_M57_MODE_V  0x00000003U
#define TEE_M57_MODE_S  0
/** TEE_M57_LOCK : R/W; bitpos: [2]; default: 0;
 *  Set 1 to lock m20 tee configuration
 */
#define TEE_M57_LOCK    (BIT(2))
#define TEE_M57_LOCK_M  (TEE_M57_LOCK_V << TEE_M57_LOCK_S)
#define TEE_M57_LOCK_V  0x00000001U
#define TEE_M57_LOCK_S  2

/** TEE_M58_MODE_CTRL_REG register
 *  TEE mode control register
 */
#define TEE_M58_MODE_CTRL_REG (DR_REG_TEE_BASE + 0xe8)
/** TEE_M58_MODE : R/W; bitpos: [1:0]; default: 3;
 *  Configures M58 security level mode.
 *  0: tee_mode
 *  1: ree_mode0
 *  2: ree_mode1
 *  3: ree_mode2
 */
#define TEE_M58_MODE    0x00000003U
#define TEE_M58_MODE_M  (TEE_M58_MODE_V << TEE_M58_MODE_S)
#define TEE_M58_MODE_V  0x00000003U
#define TEE_M58_MODE_S  0
/** TEE_M58_LOCK : R/W; bitpos: [2]; default: 0;
 *  Set 1 to lock m20 tee configuration
 */
#define TEE_M58_LOCK    (BIT(2))
#define TEE_M58_LOCK_M  (TEE_M58_LOCK_V << TEE_M58_LOCK_S)
#define TEE_M58_LOCK_V  0x00000001U
#define TEE_M58_LOCK_S  2

