espressif/esp-idf/components/soc/esp32s31/register/soc/tee_reg.h
/** TEE_M59_MODE_CTRL_REG register
 *  TEE mode control register
 */
#define TEE_M59_MODE_CTRL_REG (DR_REG_TEE_BASE + 0xec)
/** TEE_M59_MODE : R/W; bitpos: [1:0]; default: 3;
 *  Configures M59 security level mode.
 *  0: tee_mode
 *  1: ree_mode0
 *  2: ree_mode1
 *  3: ree_mode2
 */
#define TEE_M59_MODE    0x00000003U
#define TEE_M59_MODE_M  (TEE_M59_MODE_V << TEE_M59_MODE_S)
#define TEE_M59_MODE_V  0x00000003U
#define TEE_M59_MODE_S  0
/** TEE_M59_LOCK : R/W; bitpos: [2]; default: 0;
 *  Set 1 to lock m20 tee configuration
 */
#define TEE_M59_LOCK    (BIT(2))
#define TEE_M59_LOCK_M  (TEE_M59_LOCK_V << TEE_M59_LOCK_S)
#define TEE_M59_LOCK_V  0x00000001U
#define TEE_M59_LOCK_S  2

/** TEE_M60_MODE_CTRL_REG register
 *  TEE mode control register
 */
#define TEE_M60_MODE_CTRL_REG (DR_REG_TEE_BASE + 0xf0)
/** TEE_M60_MODE : R/W; bitpos: [1:0]; default: 3;
 *  Configures M60 security level mode.
 *  0: tee_mode
 *  1: ree_mode0
 *  2: ree_mode1
 *  3: ree_mode2
 */
#define TEE_M60_MODE    0x00000003U
#define TEE_M60_MODE_M  (TEE_M60_MODE_V << TEE_M60_MODE_S)
#define TEE_M60_MODE_V  0x00000003U
#define TEE_M60_MODE_S  0
/** TEE_M60_LOCK : R/W; bitpos: [2]; default: 0;
 *  Set 1 to lock m20 tee configuration
 */
#define TEE_M60_LOCK    (BIT(2))
#define TEE_M60_LOCK_M  (TEE_M60_LOCK_V << TEE_M60_LOCK_S)
#define TEE_M60_LOCK_V  0x00000001U
#define TEE_M60_LOCK_S  2

/** TEE_M61_MODE_CTRL_REG register
 *  TEE mode control register
 */
#define TEE_M61_MODE_CTRL_REG (DR_REG_TEE_BASE + 0xf4)
/** TEE_M61_MODE : R/W; bitpos: [1:0]; default: 3;
 *  Configures M61 security level mode.
 *  0: tee_mode
 *  1: ree_mode0
 *  2: ree_mode1
 *  3: ree_mode2
 */
#define TEE_M61_MODE    0x00000003U
#define TEE_M61_MODE_M  (TEE_M61_MODE_V << TEE_M61_MODE_S)
#define TEE_M61_MODE_V  0x00000003U
#define TEE_M61_MODE_S  0
/** TEE_M61_LOCK : R/W; bitpos: [2]; default: 0;
 *  Set 1 to lock m20 tee configuration
 */
#define TEE_M61_LOCK    (BIT(2))
#define TEE_M61_LOCK_M  (TEE_M61_LOCK_V << TEE_M61_LOCK_S)
#define TEE_M61_LOCK_V  0x00000001U
#define TEE_M61_LOCK_S  2

/** TEE_M62_MODE_CTRL_REG register
 *  TEE mode control register
 */
#define TEE_M62_MODE_CTRL_REG (DR_REG_TEE_BASE + 0xf8)
/** TEE_M62_MODE : R/W; bitpos: [1:0]; default: 3;
 *  Configures M62 security level mode.
 *  0: tee_mode
 *  1: ree_mode0
 *  2: ree_mode1
 *  3: ree_mode2
 */
#define TEE_M62_MODE    0x00000003U
#define TEE_M62_MODE_M  (TEE_M62_MODE_V << TEE_M62_MODE_S)
#define TEE_M62_MODE_V  0x00000003U
#define TEE_M62_MODE_S  0
/** TEE_M62_LOCK : R/W; bitpos: [2]; default: 0;
 *  Set 1 to lock m20 tee configuration
 */
#define TEE_M62_LOCK    (BIT(2))
#define TEE_M62_LOCK_M  (TEE_M62_LOCK_V << TEE_M62_LOCK_S)
#define TEE_M62_LOCK_V  0x00000001U
#define TEE_M62_LOCK_S  2

/** TEE_M63_MODE_CTRL_REG register
 *  TEE mode control register
 */
#define TEE_M63_MODE_CTRL_REG (DR_REG_TEE_BASE + 0xfc)
/** TEE_M63_MODE : R/W; bitpos: [1:0]; default: 3;
 *  Configures M63 security level mode.
 *  0: tee_mode
 *  1: ree_mode0
 *  2: ree_mode1
 *  3: ree_mode2
 */
#define TEE_M63_MODE    0x00000003U
#define TEE_M63_MODE_M  (TEE_M63_MODE_V << TEE_M63_MODE_S)
#define TEE_M63_MODE_V  0x00000003U
#define TEE_M63_MODE_S  0
/** TEE_M63_LOCK : R/W; bitpos: [2]; default: 0;
 *  Set 1 to lock m20 tee configuration
 */
#define TEE_M63_LOCK    (BIT(2))
#define TEE_M63_LOCK_M  (TEE_M63_LOCK_V << TEE_M63_LOCK_S)
#define TEE_M63_LOCK_V  0x00000001U
#define TEE_M63_LOCK_S  2

/** TEE_M64_MODE_CTRL_REG register
 *  TEE mode control register
 */
#define TEE_M64_MODE_CTRL_REG (DR_REG_TEE_BASE + 0x100)
/** TEE_M64_MODE : R/W; bitpos: [1:0]; default: 3;
 *  Configures M64 security level mode.
 *  0: tee_mode
 *  1: ree_mode0
 *  2: ree_mode1
 *  3: ree_mode2
 */
#define TEE_M64_MODE    0x00000003U
#define TEE_M64_MODE_M  (TEE_M64_MODE_V << TEE_M64_MODE_S)
#define TEE_M64_MODE_V  0x00000003U
#define TEE_M64_MODE_S  0
/** TEE_M64_LOCK : R/W; bitpos: [2]; default: 0;
 *  Set 1 to lock m20 tee configuration
 */
#define TEE_M64_LOCK    (BIT(2))
#define TEE_M64_LOCK_M  (TEE_M64_LOCK_V << TEE_M64_LOCK_S)
#define TEE_M64_LOCK_V  0x00000001U
#define TEE_M64_LOCK_S  2

/** TEE_M65_MODE_CTRL_REG register
 *  TEE mode control register
 */
#define TEE_M65_MODE_CTRL_REG (DR_REG_TEE_BASE + 0x104)
/** TEE_M65_MODE : R/W; bitpos: [1:0]; default: 3;
 *  Configures M65 security level mode.
 *  0: tee_mode
 *  1: ree_mode0
 *  2: ree_mode1
 *  3: ree_mode2
 */
#define TEE_M65_MODE    0x00000003U
#define TEE_M65_MODE_M  (TEE_M65_MODE_V << TEE_M65_MODE_S)
#define TEE_M65_MODE_V  0x00000003U
#define TEE_M65_MODE_S  0
/** TEE_M65_LOCK : R/W; bitpos: [2]; default: 0;
 *  Set 1 to lock m20 tee configuration
 */
#define TEE_M65_LOCK    (BIT(2))
#define TEE_M65_LOCK_M  (TEE_M65_LOCK_V << TEE_M65_LOCK_S)
#define TEE_M65_LOCK_V  0x00000001U
#define TEE_M65_LOCK_S  2

/** TEE_M66_MODE_CTRL_REG register
 *  TEE mode control register
 */
#define TEE_M66_MODE_CTRL_REG (DR_REG_TEE_BASE + 0x108)
/** TEE_M66_MODE : R/W; bitpos: [1:0]; default: 3;
 *  Configures M66 security level mode.
 *  0: tee_mode
 *  1: ree_mode0
 *  2: ree_mode1
 *  3: ree_mode2
 */
#define TEE_M66_MODE    0x00000003U
#define TEE_M66_MODE_M  (TEE_M66_MODE_V << TEE_M66_MODE_S)
#define TEE_M66_MODE_V  0x00000003U
#define TEE_M66_MODE_S  0
/** TEE_M66_LOCK : R/W; bitpos: [2]; default: 0;
 *  Set 1 to lock m20 tee configuration
 */
#define TEE_M66_LOCK    (BIT(2))
#define TEE_M66_LOCK_M  (TEE_M66_LOCK_V << TEE_M66_LOCK_S)
#define TEE_M66_LOCK_V  0x00000001U
#define TEE_M66_LOCK_S  2

/** TEE_M67_MODE_CTRL_REG register
 *  TEE mode control register
 */
#define TEE_M67_MODE_CTRL_REG (DR_REG_TEE_BASE + 0x10c)
/** TEE_M67_MODE : R/W; bitpos: [1:0]; default: 3;
 *  Configures M67 security level mode.
 *  0: tee_mode
 *  1: ree_mode0
 *  2: ree_mode1
 *  3: ree_mode2
 */
#define TEE_M67_MODE    0x00000003U
#define TEE_M67_MODE_M  (TEE_M67_MODE_V << TEE_M67_MODE_S)
#define TEE_M67_MODE_V  0x00000003U
#define TEE_M67_MODE_S  0
/** TEE_M67_LOCK : R/W; bitpos: [2]; default: 0;
 *  Set 1 to lock m20 tee configuration
 */
#define TEE_M67_LOCK    (BIT(2))
#define TEE_M67_LOCK_M  (TEE_M67_LOCK_V << TEE_M67_LOCK_S)
#define TEE_M67_LOCK_V  0x00000001U
#define TEE_M67_LOCK_S  2

