espressif/esp-idf/components/soc/esp32s31/register/soc/tee_reg.h
/** TEE_M68_MODE_CTRL_REG register
 *  TEE mode control register
 */
#define TEE_M68_MODE_CTRL_REG (DR_REG_TEE_BASE + 0x110)
/** TEE_M68_MODE : R/W; bitpos: [1:0]; default: 3;
 *  Configures M68 security level mode.
 *  0: tee_mode
 *  1: ree_mode0
 *  2: ree_mode1
 *  3: ree_mode2
 */
#define TEE_M68_MODE    0x00000003U
#define TEE_M68_MODE_M  (TEE_M68_MODE_V << TEE_M68_MODE_S)
#define TEE_M68_MODE_V  0x00000003U
#define TEE_M68_MODE_S  0
/** TEE_M68_LOCK : R/W; bitpos: [2]; default: 0;
 *  Set 1 to lock m20 tee configuration
 */
#define TEE_M68_LOCK    (BIT(2))
#define TEE_M68_LOCK_M  (TEE_M68_LOCK_V << TEE_M68_LOCK_S)
#define TEE_M68_LOCK_V  0x00000001U
#define TEE_M68_LOCK_S  2

/** TEE_M69_MODE_CTRL_REG register
 *  TEE mode control register
 */
#define TEE_M69_MODE_CTRL_REG (DR_REG_TEE_BASE + 0x114)
/** TEE_M69_MODE : R/W; bitpos: [1:0]; default: 3;
 *  Configures M69 security level mode.
 *  0: tee_mode
 *  1: ree_mode0
 *  2: ree_mode1
 *  3: ree_mode2
 */
#define TEE_M69_MODE    0x00000003U
#define TEE_M69_MODE_M  (TEE_M69_MODE_V << TEE_M69_MODE_S)
#define TEE_M69_MODE_V  0x00000003U
#define TEE_M69_MODE_S  0
/** TEE_M69_LOCK : R/W; bitpos: [2]; default: 0;
 *  Set 1 to lock m20 tee configuration
 */
#define TEE_M69_LOCK    (BIT(2))
#define TEE_M69_LOCK_M  (TEE_M69_LOCK_V << TEE_M69_LOCK_S)
#define TEE_M69_LOCK_V  0x00000001U
#define TEE_M69_LOCK_S  2

/** TEE_M70_MODE_CTRL_REG register
 *  TEE mode control register
 */
#define TEE_M70_MODE_CTRL_REG (DR_REG_TEE_BASE + 0x118)
/** TEE_M70_MODE : R/W; bitpos: [1:0]; default: 3;
 *  Configures M70 security level mode.
 *  0: tee_mode
 *  1: ree_mode0
 *  2: ree_mode1
 *  3: ree_mode2
 */
#define TEE_M70_MODE    0x00000003U
#define TEE_M70_MODE_M  (TEE_M70_MODE_V << TEE_M70_MODE_S)
#define TEE_M70_MODE_V  0x00000003U
#define TEE_M70_MODE_S  0
/** TEE_M70_LOCK : R/W; bitpos: [2]; default: 0;
 *  Set 1 to lock m20 tee configuration
 */
#define TEE_M70_LOCK    (BIT(2))
#define TEE_M70_LOCK_M  (TEE_M70_LOCK_V << TEE_M70_LOCK_S)
#define TEE_M70_LOCK_V  0x00000001U
#define TEE_M70_LOCK_S  2

/** TEE_M71_MODE_CTRL_REG register
 *  TEE mode control register
 */
#define TEE_M71_MODE_CTRL_REG (DR_REG_TEE_BASE + 0x11c)
/** TEE_M71_MODE : R/W; bitpos: [1:0]; default: 3;
 *  Configures M71 security level mode.
 *  0: tee_mode
 *  1: ree_mode0
 *  2: ree_mode1
 *  3: ree_mode2
 */
#define TEE_M71_MODE    0x00000003U
#define TEE_M71_MODE_M  (TEE_M71_MODE_V << TEE_M71_MODE_S)
#define TEE_M71_MODE_V  0x00000003U
#define TEE_M71_MODE_S  0
/** TEE_M71_LOCK : R/W; bitpos: [2]; default: 0;
 *  Set 1 to lock m20 tee configuration
 */
#define TEE_M71_LOCK    (BIT(2))
#define TEE_M71_LOCK_M  (TEE_M71_LOCK_V << TEE_M71_LOCK_S)
#define TEE_M71_LOCK_V  0x00000001U
#define TEE_M71_LOCK_S  2

/** TEE_M72_MODE_CTRL_REG register
 *  TEE mode control register
 */
#define TEE_M72_MODE_CTRL_REG (DR_REG_TEE_BASE + 0x120)
/** TEE_M72_MODE : R/W; bitpos: [1:0]; default: 3;
 *  Configures M72 security level mode.
 *  0: tee_mode
 *  1: ree_mode0
 *  2: ree_mode1
 *  3: ree_mode2
 */
#define TEE_M72_MODE    0x00000003U
#define TEE_M72_MODE_M  (TEE_M72_MODE_V << TEE_M72_MODE_S)
#define TEE_M72_MODE_V  0x00000003U
#define TEE_M72_MODE_S  0
/** TEE_M72_LOCK : R/W; bitpos: [2]; default: 0;
 *  Set 1 to lock m20 tee configuration
 */
#define TEE_M72_LOCK    (BIT(2))
#define TEE_M72_LOCK_M  (TEE_M72_LOCK_V << TEE_M72_LOCK_S)
#define TEE_M72_LOCK_V  0x00000001U
#define TEE_M72_LOCK_S  2

/** TEE_M73_MODE_CTRL_REG register
 *  TEE mode control register
 */
#define TEE_M73_MODE_CTRL_REG (DR_REG_TEE_BASE + 0x124)
/** TEE_M73_MODE : R/W; bitpos: [1:0]; default: 3;
 *  Configures M73 security level mode.
 *  0: tee_mode
 *  1: ree_mode0
 *  2: ree_mode1
 *  3: ree_mode2
 */
#define TEE_M73_MODE    0x00000003U
#define TEE_M73_MODE_M  (TEE_M73_MODE_V << TEE_M73_MODE_S)
#define TEE_M73_MODE_V  0x00000003U
#define TEE_M73_MODE_S  0
/** TEE_M73_LOCK : R/W; bitpos: [2]; default: 0;
 *  Set 1 to lock m20 tee configuration
 */
#define TEE_M73_LOCK    (BIT(2))
#define TEE_M73_LOCK_M  (TEE_M73_LOCK_V << TEE_M73_LOCK_S)
#define TEE_M73_LOCK_V  0x00000001U
#define TEE_M73_LOCK_S  2

/** TEE_M74_MODE_CTRL_REG register
 *  TEE mode control register
 */
#define TEE_M74_MODE_CTRL_REG (DR_REG_TEE_BASE + 0x128)
/** TEE_M74_MODE : R/W; bitpos: [1:0]; default: 3;
 *  Configures M74 security level mode.
 *  0: tee_mode
 *  1: ree_mode0
 *  2: ree_mode1
 *  3: ree_mode2
 */
#define TEE_M74_MODE    0x00000003U
#define TEE_M74_MODE_M  (TEE_M74_MODE_V << TEE_M74_MODE_S)
#define TEE_M74_MODE_V  0x00000003U
#define TEE_M74_MODE_S  0
/** TEE_M74_LOCK : R/W; bitpos: [2]; default: 0;
 *  Set 1 to lock m20 tee configuration
 */
#define TEE_M74_LOCK    (BIT(2))
#define TEE_M74_LOCK_M  (TEE_M74_LOCK_V << TEE_M74_LOCK_S)
#define TEE_M74_LOCK_V  0x00000001U
#define TEE_M74_LOCK_S  2

/** TEE_M75_MODE_CTRL_REG register
 *  TEE mode control register
 */
#define TEE_M75_MODE_CTRL_REG (DR_REG_TEE_BASE + 0x12c)
/** TEE_M75_MODE : R/W; bitpos: [1:0]; default: 3;
 *  Configures M75 security level mode.
 *  0: tee_mode
 *  1: ree_mode0
 *  2: ree_mode1
 *  3: ree_mode2
 */
#define TEE_M75_MODE    0x00000003U
#define TEE_M75_MODE_M  (TEE_M75_MODE_V << TEE_M75_MODE_S)
#define TEE_M75_MODE_V  0x00000003U
#define TEE_M75_MODE_S  0
/** TEE_M75_LOCK : R/W; bitpos: [2]; default: 0;
 *  Set 1 to lock m20 tee configuration
 */
#define TEE_M75_LOCK    (BIT(2))
#define TEE_M75_LOCK_M  (TEE_M75_LOCK_V << TEE_M75_LOCK_S)
#define TEE_M75_LOCK_V  0x00000001U
#define TEE_M75_LOCK_S  2

/** TEE_M76_MODE_CTRL_REG register
 *  TEE mode control register
 */
#define TEE_M76_MODE_CTRL_REG (DR_REG_TEE_BASE + 0x130)
/** TEE_M76_MODE : R/W; bitpos: [1:0]; default: 3;
 *  Configures M76 security level mode.
 *  0: tee_mode
 *  1: ree_mode0
 *  2: ree_mode1
 *  3: ree_mode2
 */
#define TEE_M76_MODE    0x00000003U
#define TEE_M76_MODE_M  (TEE_M76_MODE_V << TEE_M76_MODE_S)
#define TEE_M76_MODE_V  0x00000003U
#define TEE_M76_MODE_S  0
/** TEE_M76_LOCK : R/W; bitpos: [2]; default: 0;
 *  Set 1 to lock m20 tee configuration
 */
#define TEE_M76_LOCK    (BIT(2))
#define TEE_M76_LOCK_M  (TEE_M76_LOCK_V << TEE_M76_LOCK_S)
#define TEE_M76_LOCK_V  0x00000001U
#define TEE_M76_LOCK_S  2

/** TEE_M77_MODE_CTRL_REG register
 *  TEE mode control register
 */
#define TEE_M77_MODE_CTRL_REG (DR_REG_TEE_BASE + 0x134)
/** TEE_M77_MODE : R/W; bitpos: [1:0]; default: 3;
 *  Configures M77 security level mode.
 *  0: tee_mode
 *  1: ree_mode0
 *  2: ree_mode1
 *  3: ree_mode2
 */
#define TEE_M77_MODE    0x00000003U
#define TEE_M77_MODE_M  (TEE_M77_MODE_V << TEE_M77_MODE_S)
#define TEE_M77_MODE_V  0x00000003U
#define TEE_M77_MODE_S  0
/** TEE_M77_LOCK : R/W; bitpos: [2]; default: 0;
 *  Set 1 to lock m20 tee configuration
 */
#define TEE_M77_LOCK    (BIT(2))
#define TEE_M77_LOCK_M  (TEE_M77_LOCK_V << TEE_M77_LOCK_S)
#define TEE_M77_LOCK_V  0x00000001U
#define TEE_M77_LOCK_S  2

/** TEE_M78_MODE_CTRL_REG register
 *  TEE mode control register
 */
#define TEE_M78_MODE_CTRL_REG (DR_REG_TEE_BASE + 0x138)
/** TEE_M78_MODE : R/W; bitpos: [1:0]; default: 3;
 *  Configures M78 security level mode.
 *  0: tee_mode
 *  1: ree_mode0
 *  2: ree_mode1
 *  3: ree_mode2
 */
#define TEE_M78_MODE    0x00000003U
#define TEE_M78_MODE_M  (TEE_M78_MODE_V << TEE_M78_MODE_S)
#define TEE_M78_MODE_V  0x00000003U
#define TEE_M78_MODE_S  0
/** TEE_M78_LOCK : R/W; bitpos: [2]; default: 0;
 *  Set 1 to lock m20 tee configuration
 */
#define TEE_M78_LOCK    (BIT(2))
#define TEE_M78_LOCK_M  (TEE_M78_LOCK_V << TEE_M78_LOCK_S)
#define TEE_M78_LOCK_V  0x00000001U
#define TEE_M78_LOCK_S  2

/** TEE_M79_MODE_CTRL_REG register
 *  TEE mode control register
 */
#define TEE_M79_MODE_CTRL_REG (DR_REG_TEE_BASE + 0x13c)
/** TEE_M79_MODE : R/W; bitpos: [1:0]; default: 3;
 *  Configures M79 security level mode.
 *  0: tee_mode
 *  1: ree_mode0
 *  2: ree_mode1
 *  3: ree_mode2
 */
#define TEE_M79_MODE    0x00000003U
#define TEE_M79_MODE_M  (TEE_M79_MODE_V << TEE_M79_MODE_S)
#define TEE_M79_MODE_V  0x00000003U
#define TEE_M79_MODE_S  0
/** TEE_M79_LOCK : R/W; bitpos: [2]; default: 0;
 *  Set 1 to lock m20 tee configuration
 */
#define TEE_M79_LOCK    (BIT(2))
#define TEE_M79_LOCK_M  (TEE_M79_LOCK_V << TEE_M79_LOCK_S)
#define TEE_M79_LOCK_V  0x00000001U
#define TEE_M79_LOCK_S  2

/** TEE_M80_MODE_CTRL_REG register
 *  TEE mode control register
 */
#define TEE_M80_MODE_CTRL_REG (DR_REG_TEE_BASE + 0x140)
/** TEE_M80_MODE : R/W; bitpos: [1:0]; default: 3;
 *  Configures M80 security level mode.
 *  0: tee_mode
 *  1: ree_mode0
 *  2: ree_mode1
 *  3: ree_mode2
 */
#define TEE_M80_MODE    0x00000003U
#define TEE_M80_MODE_M  (TEE_M80_MODE_V << TEE_M80_MODE_S)
#define TEE_M80_MODE_V  0x00000003U
#define TEE_M80_MODE_S  0
/** TEE_M80_LOCK : R/W; bitpos: [2]; default: 0;
 *  Set 1 to lock m20 tee configuration
 */
#define TEE_M80_LOCK    (BIT(2))
#define TEE_M80_LOCK_M  (TEE_M80_LOCK_V << TEE_M80_LOCK_S)
#define TEE_M80_LOCK_V  0x00000001U
#define TEE_M80_LOCK_S  2

