espressif/esp-idf/components/soc/esp32s31/register/soc/tee_reg.h
/** TEE_M81_MODE_CTRL_REG register
 *  TEE mode control register
 */
#define TEE_M81_MODE_CTRL_REG (DR_REG_TEE_BASE + 0x144)
/** TEE_M81_MODE : R/W; bitpos: [1:0]; default: 3;
 *  Configures M81 security level mode.
 *  0: tee_mode
 *  1: ree_mode0
 *  2: ree_mode1
 *  3: ree_mode2
 */
#define TEE_M81_MODE    0x00000003U
#define TEE_M81_MODE_M  (TEE_M81_MODE_V << TEE_M81_MODE_S)
#define TEE_M81_MODE_V  0x00000003U
#define TEE_M81_MODE_S  0
/** TEE_M81_LOCK : R/W; bitpos: [2]; default: 0;
 *  Set 1 to lock m20 tee configuration
 */
#define TEE_M81_LOCK    (BIT(2))
#define TEE_M81_LOCK_M  (TEE_M81_LOCK_V << TEE_M81_LOCK_S)
#define TEE_M81_LOCK_V  0x00000001U
#define TEE_M81_LOCK_S  2

/** TEE_M82_MODE_CTRL_REG register
 *  TEE mode control register
 */
#define TEE_M82_MODE_CTRL_REG (DR_REG_TEE_BASE + 0x148)
/** TEE_M82_MODE : R/W; bitpos: [1:0]; default: 3;
 *  Configures M82 security level mode.
 *  0: tee_mode
 *  1: ree_mode0
 *  2: ree_mode1
 *  3: ree_mode2
 */
#define TEE_M82_MODE    0x00000003U
#define TEE_M82_MODE_M  (TEE_M82_MODE_V << TEE_M82_MODE_S)
#define TEE_M82_MODE_V  0x00000003U
#define TEE_M82_MODE_S  0
/** TEE_M82_LOCK : R/W; bitpos: [2]; default: 0;
 *  Set 1 to lock m20 tee configuration
 */
#define TEE_M82_LOCK    (BIT(2))
#define TEE_M82_LOCK_M  (TEE_M82_LOCK_V << TEE_M82_LOCK_S)
#define TEE_M82_LOCK_V  0x00000001U
#define TEE_M82_LOCK_S  2

/** TEE_M83_MODE_CTRL_REG register
 *  TEE mode control register
 */
#define TEE_M83_MODE_CTRL_REG (DR_REG_TEE_BASE + 0x14c)
/** TEE_M83_MODE : R/W; bitpos: [1:0]; default: 3;
 *  Configures M83 security level mode.
 *  0: tee_mode
 *  1: ree_mode0
 *  2: ree_mode1
 *  3: ree_mode2
 */
#define TEE_M83_MODE    0x00000003U
#define TEE_M83_MODE_M  (TEE_M83_MODE_V << TEE_M83_MODE_S)
#define TEE_M83_MODE_V  0x00000003U
#define TEE_M83_MODE_S  0
/** TEE_M83_LOCK : R/W; bitpos: [2]; default: 0;
 *  Set 1 to lock m20 tee configuration
 */
#define TEE_M83_LOCK    (BIT(2))
#define TEE_M83_LOCK_M  (TEE_M83_LOCK_V << TEE_M83_LOCK_S)
#define TEE_M83_LOCK_V  0x00000001U
#define TEE_M83_LOCK_S  2

/** TEE_M84_MODE_CTRL_REG register
 *  TEE mode control register
 */
#define TEE_M84_MODE_CTRL_REG (DR_REG_TEE_BASE + 0x150)
/** TEE_M84_MODE : R/W; bitpos: [1:0]; default: 3;
 *  Configures M84 security level mode.
 *  0: tee_mode
 *  1: ree_mode0
 *  2: ree_mode1
 *  3: ree_mode2
 */
#define TEE_M84_MODE    0x00000003U
#define TEE_M84_MODE_M  (TEE_M84_MODE_V << TEE_M84_MODE_S)
#define TEE_M84_MODE_V  0x00000003U
#define TEE_M84_MODE_S  0
/** TEE_M84_LOCK : R/W; bitpos: [2]; default: 0;
 *  Set 1 to lock m20 tee configuration
 */
#define TEE_M84_LOCK    (BIT(2))
#define TEE_M84_LOCK_M  (TEE_M84_LOCK_V << TEE_M84_LOCK_S)
#define TEE_M84_LOCK_V  0x00000001U
#define TEE_M84_LOCK_S  2

/** TEE_M85_MODE_CTRL_REG register
 *  TEE mode control register
 */
#define TEE_M85_MODE_CTRL_REG (DR_REG_TEE_BASE + 0x154)
/** TEE_M85_MODE : R/W; bitpos: [1:0]; default: 3;
 *  Configures M85 security level mode.
 *  0: tee_mode
 *  1: ree_mode0
 *  2: ree_mode1
 *  3: ree_mode2
 */
#define TEE_M85_MODE    0x00000003U
#define TEE_M85_MODE_M  (TEE_M85_MODE_V << TEE_M85_MODE_S)
#define TEE_M85_MODE_V  0x00000003U
#define TEE_M85_MODE_S  0
/** TEE_M85_LOCK : R/W; bitpos: [2]; default: 0;
 *  Set 1 to lock m20 tee configuration
 */
#define TEE_M85_LOCK    (BIT(2))
#define TEE_M85_LOCK_M  (TEE_M85_LOCK_V << TEE_M85_LOCK_S)
#define TEE_M85_LOCK_V  0x00000001U
#define TEE_M85_LOCK_S  2

/** TEE_M86_MODE_CTRL_REG register
 *  TEE mode control register
 */
#define TEE_M86_MODE_CTRL_REG (DR_REG_TEE_BASE + 0x158)
/** TEE_M86_MODE : R/W; bitpos: [1:0]; default: 3;
 *  Configures M86 security level mode.
 *  0: tee_mode
 *  1: ree_mode0
 *  2: ree_mode1
 *  3: ree_mode2
 */
#define TEE_M86_MODE    0x00000003U
#define TEE_M86_MODE_M  (TEE_M86_MODE_V << TEE_M86_MODE_S)
#define TEE_M86_MODE_V  0x00000003U
#define TEE_M86_MODE_S  0
/** TEE_M86_LOCK : R/W; bitpos: [2]; default: 0;
 *  Set 1 to lock m20 tee configuration
 */
#define TEE_M86_LOCK    (BIT(2))
#define TEE_M86_LOCK_M  (TEE_M86_LOCK_V << TEE_M86_LOCK_S)
#define TEE_M86_LOCK_V  0x00000001U
#define TEE_M86_LOCK_S  2

/** TEE_M87_MODE_CTRL_REG register
 *  TEE mode control register
 */
#define TEE_M87_MODE_CTRL_REG (DR_REG_TEE_BASE + 0x15c)
/** TEE_M87_MODE : R/W; bitpos: [1:0]; default: 3;
 *  Configures M87 security level mode.
 *  0: tee_mode
 *  1: ree_mode0
 *  2: ree_mode1
 *  3: ree_mode2
 */
#define TEE_M87_MODE    0x00000003U
#define TEE_M87_MODE_M  (TEE_M87_MODE_V << TEE_M87_MODE_S)
#define TEE_M87_MODE_V  0x00000003U
#define TEE_M87_MODE_S  0
/** TEE_M87_LOCK : R/W; bitpos: [2]; default: 0;
 *  Set 1 to lock m20 tee configuration
 */
#define TEE_M87_LOCK    (BIT(2))
#define TEE_M87_LOCK_M  (TEE_M87_LOCK_V << TEE_M87_LOCK_S)
#define TEE_M87_LOCK_V  0x00000001U
#define TEE_M87_LOCK_S  2

/** TEE_SUPERVISOR_PRIV_SEL_REG register
 *  TEE mode control register
 */
#define TEE_SUPERVISOR_PRIV_SEL_REG (DR_REG_TEE_BASE + 0x200)
/** TEE_CORE0_SUPERVISOR_PRIV_SEL : R/W; bitpos: [0]; default: 0;
 *  Configures the privilege of the core0 supervisor mode .
 *  0: same as user_mode
 *  1: same as machine_mode
 */
#define TEE_CORE0_SUPERVISOR_PRIV_SEL    (BIT(0))
#define TEE_CORE0_SUPERVISOR_PRIV_SEL_M  (TEE_CORE0_SUPERVISOR_PRIV_SEL_V << TEE_CORE0_SUPERVISOR_PRIV_SEL_S)
#define TEE_CORE0_SUPERVISOR_PRIV_SEL_V  0x00000001U
#define TEE_CORE0_SUPERVISOR_PRIV_SEL_S  0
/** TEE_CORE1_SUPERVISOR_PRIV_SEL : R/W; bitpos: [1]; default: 0;
 *  Configures the privilege of the core0 supervisor mode .
 *  0: same as user_mode
 *  1: same as machine_mode
 */
#define TEE_CORE1_SUPERVISOR_PRIV_SEL    (BIT(1))
#define TEE_CORE1_SUPERVISOR_PRIV_SEL_M  (TEE_CORE1_SUPERVISOR_PRIV_SEL_V << TEE_CORE1_SUPERVISOR_PRIV_SEL_S)
#define TEE_CORE1_SUPERVISOR_PRIV_SEL_V  0x00000001U
#define TEE_CORE1_SUPERVISOR_PRIV_SEL_S  1
/** TEE_CORE0_SUPERVISOR_PRIV_SEL_LOCK : R/W; bitpos: [2]; default: 0;
 *  Set 1 to lock reg_core0_supervisor_priv_sel configuration
 */
#define TEE_CORE0_SUPERVISOR_PRIV_SEL_LOCK    (BIT(2))
#define TEE_CORE0_SUPERVISOR_PRIV_SEL_LOCK_M  (TEE_CORE0_SUPERVISOR_PRIV_SEL_LOCK_V << TEE_CORE0_SUPERVISOR_PRIV_SEL_LOCK_S)
#define TEE_CORE0_SUPERVISOR_PRIV_SEL_LOCK_V  0x00000001U
#define TEE_CORE0_SUPERVISOR_PRIV_SEL_LOCK_S  2
/** TEE_CORE1_SUPERVISOR_PRIV_SEL_LOCK : R/W; bitpos: [3]; default: 0;
 *  Set 1 to lock reg_core1_supervisor_priv_sel configuration
 */
#define TEE_CORE1_SUPERVISOR_PRIV_SEL_LOCK    (BIT(3))
#define TEE_CORE1_SUPERVISOR_PRIV_SEL_LOCK_M  (TEE_CORE1_SUPERVISOR_PRIV_SEL_LOCK_V << TEE_CORE1_SUPERVISOR_PRIV_SEL_LOCK_S)
#define TEE_CORE1_SUPERVISOR_PRIV_SEL_LOCK_V  0x00000001U
#define TEE_CORE1_SUPERVISOR_PRIV_SEL_LOCK_S  3

/** TEE_CLOCK_GATE_REG register
 *  Clock gating register
 */
#define TEE_CLOCK_GATE_REG (DR_REG_TEE_BASE + 0x3f8)
/** TEE_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  Configures whether to keep the clock always on.
 *  0: enable automatic clock gating
 *  1: keep the clock always on
 */
#define TEE_CLK_EN    (BIT(0))
#define TEE_CLK_EN_M  (TEE_CLK_EN_V << TEE_CLK_EN_S)
#define TEE_CLK_EN_V  0x00000001U
#define TEE_CLK_EN_S  0

/** TEE_DATE_REG register
 *  Version control register
 */
#define TEE_DATE_REG (DR_REG_TEE_BASE + 0x3fc)
/** TEE_DATE : R/W; bitpos: [27:0]; default: 38822480;
 *  Version control register
 */
#define TEE_DATE    0x0FFFFFFFU
#define TEE_DATE_M  (TEE_DATE_V << TEE_DATE_S)
#define TEE_DATE_V  0x0FFFFFFFU
#define TEE_DATE_S  0

#ifdef __cplusplus
}
#endif
